nxp-mcuxpresso/mcux-sdk/devices/LPC55S04/LPC55S04.h
/*! @name GPO3_0 - GPO3 register 0 description */
/*! @{ */

#define FLASH_NMPA_GPO3_0_AUX_BIAS_TRIM_VALID_MASK (0x1U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_TRIM_VALID_SHIFT (0U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_TRIM_VALID(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_AUX_BIAS_TRIM_VALID_SHIFT)) & FLASH_NMPA_GPO3_0_AUX_BIAS_TRIM_VALID_MASK)

#define FLASH_NMPA_GPO3_0_AUX_BIAS_ITRIM_MASK    (0x3EU)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_ITRIM_SHIFT   (1U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_ITRIM(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_AUX_BIAS_ITRIM_SHIFT)) & FLASH_NMPA_GPO3_0_AUX_BIAS_ITRIM_MASK)

#define FLASH_NMPA_GPO3_0_AUX_BIAS_PTAT_ITRIM_MASK (0x7C0U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_PTAT_ITRIM_SHIFT (6U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_PTAT_ITRIM(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_AUX_BIAS_PTAT_ITRIM_SHIFT)) & FLASH_NMPA_GPO3_0_AUX_BIAS_PTAT_ITRIM_MASK)

#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VTRIM_MASK (0xF800U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VTRIM_SHIFT (11U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VTRIM(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VTRIM_SHIFT)) & FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VTRIM_MASK)

#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VCURVE_TRIM_MASK (0x70000U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VCURVE_TRIM_SHIFT (16U)
#define FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VCURVE_TRIM(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VCURVE_TRIM_SHIFT)) & FLASH_NMPA_GPO3_0_AUX_BIAS_VREF1_VCURVE_TRIM_MASK)

#define FLASH_NMPA_GPO3_0_FIELD_MASK             (0x1F80000U)
#define FLASH_NMPA_GPO3_0_FIELD_SHIFT            (19U)
#define FLASH_NMPA_GPO3_0_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_FIELD_SHIFT)) & FLASH_NMPA_GPO3_0_FIELD_MASK)

#define FLASH_NMPA_GPO3_0_MODELNUM_EXTENSION_MASK (0xE000000U)
#define FLASH_NMPA_GPO3_0_MODELNUM_EXTENSION_SHIFT (25U)
/*! MODELNUM_EXTENSION - ModelNumber extension[2:0]
 */
#define FLASH_NMPA_GPO3_0_MODELNUM_EXTENSION(x)  (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_MODELNUM_EXTENSION_SHIFT)) & FLASH_NMPA_GPO3_0_MODELNUM_EXTENSION_MASK)

#define FLASH_NMPA_GPO3_0_FINAL_TEST_NOT_DONE_MASK (0xF0000000U)
#define FLASH_NMPA_GPO3_0_FINAL_TEST_NOT_DONE_SHIFT (28U)
/*! FINAL_TEST_NOT_DONE - FINAL_TEST_NOT_DONE[3:0]: 1010 : Final Test Not Done. All Other values: Final Test Done.
 */
#define FLASH_NMPA_GPO3_0_FINAL_TEST_NOT_DONE(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_0_FINAL_TEST_NOT_DONE_SHIFT)) & FLASH_NMPA_GPO3_0_FINAL_TEST_NOT_DONE_MASK)
/*! @} */

/*! @name GPO3_1 - GPO3 register 1 description */
/*! @{ */

#define FLASH_NMPA_GPO3_1_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO3_1_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO3_1_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_1_FIELD_SHIFT)) & FLASH_NMPA_GPO3_1_FIELD_MASK)
/*! @} */

/*! @name GPO3_2 - GPO3 register 2 description */
/*! @{ */

#define FLASH_NMPA_GPO3_2_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO3_2_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO3_2_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_2_FIELD_SHIFT)) & FLASH_NMPA_GPO3_2_FIELD_MASK)
/*! @} */

/*! @name GPO3_3 - GPO3 register 3 description */
/*! @{ */

#define FLASH_NMPA_GPO3_3_FIELD_MASK             (0xFFFFFFFFU)
#define FLASH_NMPA_GPO3_3_FIELD_SHIFT            (0U)
#define FLASH_NMPA_GPO3_3_FIELD(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_3_FIELD_SHIFT)) & FLASH_NMPA_GPO3_3_FIELD_MASK)
/*! @} */

/*! @name GPO3_ARRAY - GPO3 array description */
/*! @{ */

#define FLASH_NMPA_GPO3_ARRAY_FIELD_MASK         (0xFFFFFFFFU)
#define FLASH_NMPA_GPO3_ARRAY_FIELD_SHIFT        (0U)
#define FLASH_NMPA_GPO3_ARRAY_FIELD(x)           (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO3_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_GPO3_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_GPO3_ARRAY */
#define FLASH_NMPA_GPO3_ARRAY_COUNT              (4U)

/*! @name GPO_CHECKSUM_0 - checksum of the GPO data in words 0 */
/*! @{ */

#define FLASH_NMPA_GPO_CHECKSUM_0_FIELD_MASK     (0xFFFFFFFFU)
#define FLASH_NMPA_GPO_CHECKSUM_0_FIELD_SHIFT    (0U)
#define FLASH_NMPA_GPO_CHECKSUM_0_FIELD(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO_CHECKSUM_0_FIELD_SHIFT)) & FLASH_NMPA_GPO_CHECKSUM_0_FIELD_MASK)
/*! @} */

/*! @name GPO_CHECKSUM_1 - checksum of the GPO data in words 1 */
/*! @{ */

#define FLASH_NMPA_GPO_CHECKSUM_1_FIELD_MASK     (0xFFFFFFFFU)
#define FLASH_NMPA_GPO_CHECKSUM_1_FIELD_SHIFT    (0U)
#define FLASH_NMPA_GPO_CHECKSUM_1_FIELD(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO_CHECKSUM_1_FIELD_SHIFT)) & FLASH_NMPA_GPO_CHECKSUM_1_FIELD_MASK)
/*! @} */

/*! @name GPO_CHECKSUM_2 - checksum of the GPO data in words 2 */
/*! @{ */

#define FLASH_NMPA_GPO_CHECKSUM_2_FIELD_MASK     (0xFFFFFFFFU)
#define FLASH_NMPA_GPO_CHECKSUM_2_FIELD_SHIFT    (0U)
#define FLASH_NMPA_GPO_CHECKSUM_2_FIELD(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO_CHECKSUM_2_FIELD_SHIFT)) & FLASH_NMPA_GPO_CHECKSUM_2_FIELD_MASK)
/*! @} */

/*! @name GPO_CHECKSUM_3 - checksum of the GPO data in words 3 */
/*! @{ */

#define FLASH_NMPA_GPO_CHECKSUM_3_FIELD_MASK     (0xFFFFFFFFU)
#define FLASH_NMPA_GPO_CHECKSUM_3_FIELD_SHIFT    (0U)
#define FLASH_NMPA_GPO_CHECKSUM_3_FIELD(x)       (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO_CHECKSUM_3_FIELD_SHIFT)) & FLASH_NMPA_GPO_CHECKSUM_3_FIELD_MASK)
/*! @} */

/*! @name GPO_CHECKSUM_ARRAY - checksum of the GPO data in words [3:0] */
/*! @{ */

#define FLASH_NMPA_GPO_CHECKSUM_ARRAY_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_GPO_CHECKSUM_ARRAY_FIELD_SHIFT (0U)
#define FLASH_NMPA_GPO_CHECKSUM_ARRAY_FIELD(x)   (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_GPO_CHECKSUM_ARRAY_FIELD_SHIFT)) & FLASH_NMPA_GPO_CHECKSUM_ARRAY_FIELD_MASK)
/*! @} */

/* The count of FLASH_NMPA_GPO_CHECKSUM_ARRAY */
#define FLASH_NMPA_GPO_CHECKSUM_ARRAY_COUNT      (4U)

/*! @name FINAL_TEST_BATCH_ID_0 -  */
/*! @{ */

#define FLASH_NMPA_FINAL_TEST_BATCH_ID_0_FIELD_MASK (0xFFFFFFFFU)
#define FLASH_NMPA_FINAL_TEST_BATCH_ID_0_FIELD_SHIFT (0U)
#define FLASH_NMPA_FINAL_TEST_BATCH_ID_0_FIELD(x) (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_FINAL_TEST_BATCH_ID_0_FIELD_SHIFT)) & FLASH_NMPA_FINAL_TEST_BATCH_ID_0_FIELD_MASK)
/*! @} */

