nxp-mcuxpresso/mcux-sdk/devices/LPC55S04/LPC55S04.h
#define PUF_IDXBLK_DP_IDX6_MASK                  (0x3000U)
#define PUF_IDXBLK_DP_IDX6_SHIFT                 (12U)
/*! IDX6 - Use to block PUF index 6
 */
#define PUF_IDXBLK_DP_IDX6(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX6_SHIFT)) & PUF_IDXBLK_DP_IDX6_MASK)

#define PUF_IDXBLK_DP_IDX7_MASK                  (0xC000U)
#define PUF_IDXBLK_DP_IDX7_SHIFT                 (14U)
/*! IDX7 - Use to block PUF index 7
 */
#define PUF_IDXBLK_DP_IDX7(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX7_SHIFT)) & PUF_IDXBLK_DP_IDX7_MASK)

#define PUF_IDXBLK_DP_IDX8_MASK                  (0x30000U)
#define PUF_IDXBLK_DP_IDX8_SHIFT                 (16U)
/*! IDX8 - Use to block PUF index 8
 */
#define PUF_IDXBLK_DP_IDX8(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX8_SHIFT)) & PUF_IDXBLK_DP_IDX8_MASK)

#define PUF_IDXBLK_DP_IDX9_MASK                  (0xC0000U)
#define PUF_IDXBLK_DP_IDX9_SHIFT                 (18U)
/*! IDX9 - Use to block PUF index 9
 */
#define PUF_IDXBLK_DP_IDX9(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX9_SHIFT)) & PUF_IDXBLK_DP_IDX9_MASK)

#define PUF_IDXBLK_DP_IDX10_MASK                 (0x300000U)
#define PUF_IDXBLK_DP_IDX10_SHIFT                (20U)
/*! IDX10 - Use to block PUF index 10
 */
#define PUF_IDXBLK_DP_IDX10(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX10_SHIFT)) & PUF_IDXBLK_DP_IDX10_MASK)

#define PUF_IDXBLK_DP_IDX11_MASK                 (0xC00000U)
#define PUF_IDXBLK_DP_IDX11_SHIFT                (22U)
/*! IDX11 - Use to block PUF index 11
 */
#define PUF_IDXBLK_DP_IDX11(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX11_SHIFT)) & PUF_IDXBLK_DP_IDX11_MASK)

#define PUF_IDXBLK_DP_IDX12_MASK                 (0x3000000U)
#define PUF_IDXBLK_DP_IDX12_SHIFT                (24U)
/*! IDX12 - Use to block PUF index 12
 */
#define PUF_IDXBLK_DP_IDX12(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX12_SHIFT)) & PUF_IDXBLK_DP_IDX12_MASK)

#define PUF_IDXBLK_DP_IDX13_MASK                 (0xC000000U)
#define PUF_IDXBLK_DP_IDX13_SHIFT                (26U)
/*! IDX13 - Use to block PUF index 13
 */
#define PUF_IDXBLK_DP_IDX13(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX13_SHIFT)) & PUF_IDXBLK_DP_IDX13_MASK)

#define PUF_IDXBLK_DP_IDX14_MASK                 (0x30000000U)
#define PUF_IDXBLK_DP_IDX14_SHIFT                (28U)
/*! IDX14 - Use to block PUF index 14
 */
#define PUF_IDXBLK_DP_IDX14(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX14_SHIFT)) & PUF_IDXBLK_DP_IDX14_MASK)

#define PUF_IDXBLK_DP_IDX15_MASK                 (0xC0000000U)
#define PUF_IDXBLK_DP_IDX15_SHIFT                (30U)
/*! IDX15 - Use to block PUF index 15
 */
#define PUF_IDXBLK_DP_IDX15(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX15_SHIFT)) & PUF_IDXBLK_DP_IDX15_MASK)
/*! @} */

/*! @name KEYMASK - Only reset in case of full IC reset */
/*! @{ */

#define PUF_KEYMASK_KEYMASK_MASK                 (0xFFFFFFFFU)
#define PUF_KEYMASK_KEYMASK_SHIFT                (0U)
#define PUF_KEYMASK_KEYMASK(x)                   (((uint32_t)(((uint32_t)(x)) << PUF_KEYMASK_KEYMASK_SHIFT)) & PUF_KEYMASK_KEYMASK_MASK)
/*! @} */

/* The count of PUF_KEYMASK */
#define PUF_KEYMASK_COUNT                        (4U)

/*! @name IDXBLK_STATUS - Index block status */
/*! @{ */

#define PUF_IDXBLK_STATUS_IDX0_MASK              (0x3U)
#define PUF_IDXBLK_STATUS_IDX0_SHIFT             (0U)
/*! IDX0 - Status block index 0
 */
#define PUF_IDXBLK_STATUS_IDX0(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX0_SHIFT)) & PUF_IDXBLK_STATUS_IDX0_MASK)

#define PUF_IDXBLK_STATUS_IDX1_MASK              (0xCU)
#define PUF_IDXBLK_STATUS_IDX1_SHIFT             (2U)
/*! IDX1 - Status block index 1
 */
#define PUF_IDXBLK_STATUS_IDX1(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX1_SHIFT)) & PUF_IDXBLK_STATUS_IDX1_MASK)

#define PUF_IDXBLK_STATUS_IDX2_MASK              (0x30U)
#define PUF_IDXBLK_STATUS_IDX2_SHIFT             (4U)
/*! IDX2 - Status block index 2
 */
#define PUF_IDXBLK_STATUS_IDX2(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX2_SHIFT)) & PUF_IDXBLK_STATUS_IDX2_MASK)

#define PUF_IDXBLK_STATUS_IDX3_MASK              (0xC0U)
#define PUF_IDXBLK_STATUS_IDX3_SHIFT             (6U)
/*! IDX3 - Status block index 3
 */
#define PUF_IDXBLK_STATUS_IDX3(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX3_SHIFT)) & PUF_IDXBLK_STATUS_IDX3_MASK)

#define PUF_IDXBLK_STATUS_IDX4_MASK              (0x300U)
#define PUF_IDXBLK_STATUS_IDX4_SHIFT             (8U)
/*! IDX4 - Status block index 4
 */
#define PUF_IDXBLK_STATUS_IDX4(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX4_SHIFT)) & PUF_IDXBLK_STATUS_IDX4_MASK)

#define PUF_IDXBLK_STATUS_IDX5_MASK              (0xC00U)
#define PUF_IDXBLK_STATUS_IDX5_SHIFT             (10U)
/*! IDX5 - Status block index 5
 */
#define PUF_IDXBLK_STATUS_IDX5(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX5_SHIFT)) & PUF_IDXBLK_STATUS_IDX5_MASK)

#define PUF_IDXBLK_STATUS_IDX6_MASK              (0x3000U)
#define PUF_IDXBLK_STATUS_IDX6_SHIFT             (12U)
/*! IDX6 - Status block index 6
 */
#define PUF_IDXBLK_STATUS_IDX6(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX6_SHIFT)) & PUF_IDXBLK_STATUS_IDX6_MASK)

#define PUF_IDXBLK_STATUS_IDX7_MASK              (0xC000U)
#define PUF_IDXBLK_STATUS_IDX7_SHIFT             (14U)
/*! IDX7 - Status block index 7
 */
#define PUF_IDXBLK_STATUS_IDX7(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX7_SHIFT)) & PUF_IDXBLK_STATUS_IDX7_MASK)

#define PUF_IDXBLK_STATUS_IDX8_MASK              (0x30000U)
#define PUF_IDXBLK_STATUS_IDX8_SHIFT             (16U)
/*! IDX8 - Status block index 8
 */
#define PUF_IDXBLK_STATUS_IDX8(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX8_SHIFT)) & PUF_IDXBLK_STATUS_IDX8_MASK)

#define PUF_IDXBLK_STATUS_IDX9_MASK              (0xC0000U)
#define PUF_IDXBLK_STATUS_IDX9_SHIFT             (18U)
/*! IDX9 - Status block index 9
 */
#define PUF_IDXBLK_STATUS_IDX9(x)                (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX9_SHIFT)) & PUF_IDXBLK_STATUS_IDX9_MASK)

#define PUF_IDXBLK_STATUS_IDX10_MASK             (0x300000U)
#define PUF_IDXBLK_STATUS_IDX10_SHIFT            (20U)
/*! IDX10 - Status block index 10
 */
#define PUF_IDXBLK_STATUS_IDX10(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX10_SHIFT)) & PUF_IDXBLK_STATUS_IDX10_MASK)

#define PUF_IDXBLK_STATUS_IDX11_MASK             (0xC00000U)
#define PUF_IDXBLK_STATUS_IDX11_SHIFT            (22U)
/*! IDX11 - Status block index 11
 */
#define PUF_IDXBLK_STATUS_IDX11(x)               (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_STATUS_IDX11_SHIFT)) & PUF_IDXBLK_STATUS_IDX11_MASK)

